cfMesh/main_mesh/system/controlDict
/*--------------------------------*- C++ -*---------------------------------*\ 
| ========                 |                                                 | 
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           | 
|  \    /   O peration     | Version:  v1812                                 | 
|   \  /    A nd           | Web:      www.OpenFOAM.com                      | 
|    \/     M anipulation  |                                                 | 
\*--------------------------------------------------------------------------*/ 
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         5000;
deltaT          1;
writeControl    timeStep;
writeInterval   1000;
purgeWrite      0;
writeFormat     ascii;
writePrecision  8;
writeCompression off;
timeFormat      general;
timePrecision   8;
runTimeModifiable true;

DebugSwitches
{
    SolverPerformance 1;
}
/*
functions

{

wallShearStress1
	{
	type		wallShearStress;
           libs        ("libfieldFunctionObjects.so");
	patches		(airfoil);
	writePrecision	8;
	writeToFile	true;
	executeControl	timeStep;
	writeControl	timeStep;
	writeInterval	50;
	writeFields	true;
	}
averageWallShearStress
	{
	type		surfaceFieldValue;
	libs		("libfieldFunctionObjects.so");
	fields		(wallShearStress);
	operation		areaAverage;
	regionType		patch;
	surfaceFormat   	none;
	name		airfoil;
	writePrecision	8;
	writeToFile	true;
	executeControl	timeStep;
	executeInterval 	1;

	writeControl	timeStep;
	writeInterval	50;
	writeFields	true;
	}
forceCoeffs1
	{
           type        forceCoeffs;
           libs        ("libforces.so");
           log         yes;
           writeFields yes;
           patches     (airfoil);
           liftDir     (0 1 0);
           dragDir     (-1 0 0);
           pitchAxis   (0 0 1);
           CofR 	 (0 0 0);
           magUInf     1;
           lRef        1;
           rhoInf	 1;
           rho	 rhoInf;
           Aref        0.02;
           writePrecision	8;
	writeToFile	true;
	executeControl	timeStep;
	executeInterval 	1;
	writeControl	timeStep;
	writeInterval	50;
           }
}
*/
