cfMesh/main_mesh/constant/transportProperties
/*--------------------------------*- C++ -*---------------------------------*\ 
| ========                 |                                                 | 
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           | 
|  \    /   O peration     | Version:  v1812                                 | 
|   \  /    A nd           | Web:      www.OpenFOAM.com                      | 
|    \/     M anipulation  |                                                 | 
\*--------------------------------------------------------------------------*/ 
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


transportModel  Newtonian;

rho             [1 -3 0 0 0 0 0] 1;

nu              [0 2 -1 0 0 0 0] 0.064e-05;

Pr 		0.7;
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
