cfMesh/main_mesh/0/nuTilda
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nuTilda;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];


internalField   uniform 0.24e-05;

boundaryField
{
        front
    {
        type            symmetry;
    }
    back
    {
        type            symmetry;
    }
       
       
       top
    {
        type            symmetry;
    }
    bottom
    {
        type            fixedValue;
        value           uniform 0;
    }
    airfoil
    {
        type            nutUWallFunction;
        value           $internalField;
    }
    inlet
    {
        type            	 freestream;
        freestreamValue           uniform 4.0140e-06;
    }
    outlet
    {
	type            	zeroGradient;

    }
}


// ************************************************************************* //
