cfMesh/main_mesh/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];


internalField   uniform 0.064e-05;

boundaryField
{
    front
    {
        type            symmetry;
    }
    back
    {
        type            symmetry;
    }
       
    top
    {
        type            symmetry;
    }
    bottom
    {
        type            calculated;
        value           uniform 0;
    }
    airfoil
    {
        type            calculated;
        value           uniform 0;
    }
    inlet
    {
	type            	     calculated;
           value           uniform 0;
    }
    outlet
    {
	type            	    calculated;
        	value           uniform 0;

    }
}


// ************************************************************************* //
